<template>
  <main class="page">
    <div class="screen">
      <Background/>
      <div class="screen__container">
        <Logo/>
        <div class="screen__body">
          <Doves/>
          <div class="screen__content">
            <div class="screen__info">
              <p class="screen__text">Полёт голубей бойных пород отличается следующими характеристиками:</p>
              <ul class="screen__text">
                <li>покинув голубятню, птицы совершают кружащий полёт, описывают несколько кругов над крышей;</li>
                <li>далее птицы разлетаются (полёт россыпью);</li>
                <li>
                  свои пируэты в воздухе первым обычно выполняет вожак; он отделяется от стаи и начинает набирать высоту, совершая кувырки, и не
                  переставая выполнять щелчки крыльями;
                </li>
                <li>особенно ценятся птицы, которые уходят в столб; высота столба может составлять 15-20 м;</li>
                <li>набрав высоту, голубь немного снижается, чтобы вновь подняться в небо, переворачиваясь в воздухе;</li>
                <li>достигнув своей высшей точки полёта, вожак садится на хвост и будто бы скатывается с воздушной горки;</li>
                <li>за вожаком подобным образом поднимаются и другие особи.</li>
              </ul>
              <p class="screen__text">
                Иногда вожак ждёт всю стаю на высоте, зависая в воздухе. После того, как все собрались, начинаются зрелищные «скатывания с горки».
                <br />Проделав 2-3 таких полёта, птицы сильно устают. Им требуется отдых. Они садятся на крыши или на ветки деревьев. Сгонять их не следует.
                Через 20 минут они вновь поднимутся в воздух, чтобы возобновить свои головокружительные акробатические элементы.
              </p>
              <p class="screen__text">В целом к одному году (реже к полутора-двум годам) молодые летуны достигают ожидаемого уровня мастерства.</p>
              <p class="screen__text">
                Тренированные «пакистанцы» ловкие и сильные, они уверенно держатся в небе, противостоят воздушным потокам, совершают кувырки, удерживая
                равновесие.
              </p>
              <p class="screen__text">
                Эти голуби длительное время проводят в небе без ущерба для здоровья, восхищая своей силой, быстротой и выносливостью.
              </p>
            </div>
          </div>
          <Navigation :page-next="pageNext" :page-prev="pagePrev"/>
        </div>
      </div>
    </div>
  </main>
</template>

<script>
import {mapActions} from 'vuex'
import Navigation from "@/components/Navigation";
import Doves from "@/components/Doves";
import Logo from "@/components/Logo";
import Background from "@/components/Background";

export default {
  name: "Page-6",
  data() {
    return {
      pagePrev: 'page-5',
      pageNext: 'page-7',
    }
  },
  components: {
    Doves,
    Logo,
    Background,
    Navigation
  },
  mounted() {
    this.animate()
  },
  methods: {
    ...mapActions([
      'animate'
    ]),
  }
}
</script>